irun(64): 15.20-s076: (c) Copyright 1995-2019 Cadence Design Systems, Inc.
file: ./netlist.vams
	module final_project.clk_nonoverlapping:schematic
		errors: 0, warnings: 0
	module final_project.EE140_Fa19_digital:schematic
		errors: 0, warnings: 0
	module final_project.zz_EE140_Fa19_digital:schematic
		errors: 0, warnings: 0
file: ./cds_globals.vams
	module worklib.cds_globals:vams
		errors: 0, warnings: 0
file: /home/ff/ee140/fa19/cadence/ee140_gsi/SAR_FSM/functional/verilog.v
	module ee140_gsi.SAR_FSM:functional
		errors: 0, warnings: 0
ncvlog: *W,SPDUSD: Include directory /home/cc/ee140/fa19/class/ee140-abc/Documents/ee240-project/ given but not used.
	Total errors/warnings found outside modules and primitives:
		errors: 0, warnings: 1
ncvlog: Memory Usage - 21.3M program + 29.5M data = 50.9M total
ncvlog: CPU Usage - 0.0s system + 0.0s user = 0.1s total (0.1s, 45.0% cpu)

		Caching library 'final_project' ....... Done
		Caching library 'ee140_gsi' ....... Done
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		zz_EE140_Fa19_digital
		cds_globals
	Discipline resolution Pass...
	Doing auto-insertion of connection elements...
	Connect Rules applied are:
		logic_cr
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		ee140_gsi.SAR_FSM:functional <0x4c2defb0>
			streams:   4, words:  1794
		final_project.zz_EE140_Fa19_digital:schematic <0x483e04cf>
			streams:   0, words:     0
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:               111      21
		Registers:             100     146
		Scalar wires:           16       -
		Vectored wires:         19       -
		Named events:            6       6
		Always blocks:          29      50
		Initial blocks:         12      22
		Cont. assignments:       7      15
		Interconnect:          427       -
		Simulation timescale:  1ps
	Writing initial simulation snapshot: final_project.zz_EE140_Fa19_digital:config
ncelab: Memory Usage - 49.9M program + 54.5M data = 104.4M total (Peak 238.5M)
ncelab: CPU Usage - 0.1s system + 0.2s user = 0.3s total (0.4s, 77.0% cpu)
Loading snapshot final_project.zz_EE140_Fa19_digital:config .................... Done
ncsim: *W,NXDMSO: This design will require a check out of DMSO license when it is run with Xcelium.
Simulating in AMS-SIE mode...
	Starting analog simulation engine...
AMSD: Environment variable:
        SPECTRE_DEFAULTS = -E
AMSD: Using spectre solver with arguments: -E -ahdllibdir INCA_libs/AMSD/ahdlSimDB.

Cadence (R) Virtuoso (R) Spectre (R) Circuit Simulator
Version 15.1.0.803.isr18 64bit -- 25 Jul 2017
Copyright (C) 1989-2017 Cadence Design Systems, Inc. All rights reserved
        worldwide. Cadence, Virtuoso and Spectre are registered trademarks of
        Cadence Design Systems, Inc. All others are the property of their
        respective holders.

Includes RSA BSAFE(R) Cryptographic or Security Protocol Software from RSA
        Security, Inc.

User: ee140-abc   Host: eda-7.EECS.Berkeley.EDU   HostID: 2080B086   PID:
        18104
Memory  available: 4.5293 GB  physical: 25.2693 GB
Linux   : CentOS Linux release 7.7.1908 (Core)
CPU Type: Intel(R) Xeon(R) CPU           X5550  @ 2.67GHz
        Socket: Processors [Frequency] (Hyperthreaded Processor)
        0:       0 [1600.0] (  8 ),  1 [1600.0] (  9 ),  2 [1600.0] ( 10 )
                 3 [1600.0] ( 11 )
        1:       4 [1600.0] ( 12 ),  5 [1600.0] ( 13 ),  6 [1600.0] ( 14 )
                 7 [1600.0] ( 15 )
        
System load averages (1min, 5min, 15min) : 7.5 %, 7.4 %, 6.5 %
Hyperthreading is enabled


Analog Kernel using -ANALOGCONTROL  ./spiceModels.scs.
Reading file: 
        /home/cc/ee140/fa19/class/ee140-abc/Documents/ee240-project/Sim/zz_EE140_Fa19_digital/ams/config/netlist/spiceModels.scs
Reading file: 
        /home/cc/ee140/fa19/class/ee140-abc/Documents/ee240-project/Sim/zz_EE140_Fa19_digital/ams/config/netlist/netlist.vams
Reading link:  /share/instsww/cadence/INCISIVE.15.20.076/tools
Reading file: 
        /share/instsww/cadence/INCISIVE.15.20.076/tools.lnx86/affirma_ams/etc/connect_lib/L2E_2_dynsup.vams
Reading file: 
        /home/cc/ee140/fa19/class/ee140-abc/Documents/ee240-project/Sim/zz_EE140_Fa19_digital/ams/config/netlist/INCA_libs/AMSD/ahdlSimDB/3651_tools_affirma_ams_etc_connect_lib_L2E_2_dynsup.vams.connectLib__L2E_2_dynsup__module__0x10000001_behavioral.ahdlcmi/Linux-64/obj/optimize/5.0/libahdlcmi_connectLib__L2E_2_dynsup__module__0x10000001_behavioral.so
Installed compiled interface for
        connectLib__L2E_2_dynsup__module__0x10000001_behavioral.
Reading file: 
        /share/instsww/cadence/INCISIVE.15.20.076/tools.lnx86/affirma_ams/etc/connect_lib/E2L_2_dynsup.vams
Reading file: 
        /home/cc/ee140/fa19/class/ee140-abc/Documents/ee240-project/Sim/zz_EE140_Fa19_digital/ams/config/netlist/INCA_libs/AMSD/ahdlSimDB/3651_tools_affirma_ams_etc_connect_lib_E2L_2_dynsup.vams.connectLib__E2L_2_dynsup__module__0x10000001_behavioral.ahdlcmi/Linux-64/obj/optimize/5.0/libahdlcmi_connectLib__E2L_2_dynsup__module__0x10000001_behavioral.so
Installed compiled interface for
        connectLib__E2L_2_dynsup__module__0x10000001_behavioral.
Reading file: 
        /share/instsww/cadence/INCISIVE.15.20.076/tools.lnx86/spectre/etc/configs/mapsubckt.cfg
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/config.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/param.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/bip.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/tm_bip.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpva.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpva_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvb_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvc_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpva5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpva5_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvb5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvb5_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvc5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvc5_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpve.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpve_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvf_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvg.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvg_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpve5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpve5_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvf5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvf5_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvg5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpvg5_dbc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qnv5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/bip/qpv5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/cap.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/tm_cap.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cdmm4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cdmm5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cdmm4t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cdmm5t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/ctmm5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/ctmm5t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmm3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmm4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmm5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmm3t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmm4t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmm5t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmm6t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh3t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh4t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh5t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh6t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cdmmh4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cdmmh5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cdmmh4t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cdmmh5t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/ctmmh5t.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/ctmmh5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh4l.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh5l.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cmmh6l.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csandwt3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csandwt4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csandwt5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cp1sub.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cp1suba.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cp1subp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csf2p.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csf3p.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csf3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csf4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csf5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csft4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csft5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csft6.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csf3a.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csf4a.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csf5a.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csft4a.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csft5a.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/csft6a.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/p_cap.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/mosvc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/mosvc_pmos.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/mosvcti.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/mosvcti_nmos.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/mosvc5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/mosvc5_pmos.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/mosvc5ti.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/mosvc5ti_nmos.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cif3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cif4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/cif5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/tag_25v.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/tag_60v.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/tag_100v.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/tag_200v.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/tag_m25v.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/tag_m60v.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/tag_m100v.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/cap/tag_m200v.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/dio.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/tm_dio.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dn.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dnw.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dn5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dp5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dnw5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dhw2a.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dhw2.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dhw3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdpa.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwnsj1_7.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwnsj1_10.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwnsj1_16c.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwpsj1_7.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwpsj1_10.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwpsj1_16c.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dpp6.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dpp7.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dnp7.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/ds5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/ds5a.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdn5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdnt.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdnu.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdpta.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdptb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdpu.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dnpa.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dnpati.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dza.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dzati.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dzbti.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/drxw.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dnw5mva.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dnn.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dnn5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdnha.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdnhb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdnhc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdnhd.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdnhe.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdnhf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdpha.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdphb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdphc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdphd.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdphe.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdphf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdpb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdpc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdpd.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdpe.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/dio/dfwdpf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/mos.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/tm_mos.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nn.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nn_jf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/ne.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pe.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/ne5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pe5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nmva.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pmva.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/peti.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pe5ti.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhsj1_7.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhsj1_10.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhsj1_16c.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phsj1_7.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phsj1_10.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phsj1_16c.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nn5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nn5_jf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhvta.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhvtb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phvta.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phvtb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhvu.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phvu.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nel.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pel.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/ndhvt.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pe_5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pel_5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pe5_5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nisj1_16.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nisj1_16_m1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nisj1_16_q1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/ndhvta.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nd5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nd5_mos1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nd5_mos2.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhvra.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhvrb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhvrc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhvrd.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhvre.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/nhvrf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phvra.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phvrb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phvrc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phvrd.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phvre.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/phvrf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pmvb.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pmvc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pmvd.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pmve.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/pmvf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/ndhvrd.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/mos/ndhvrf.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/res.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/tm_res.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rnw.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rdn.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rdp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rnw5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rdn5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rdp5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rnp1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rnp1_3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rpp1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rpp1_3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rpp1s.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rpp1s_3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rnp1h.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rnp1h_3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rpp1k1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rpp1k1_3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rpp1k1a.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rpp1k1a_3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rm1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rm2.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rm3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rm4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rm5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rmtp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rmtpl.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rmrdl.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rctdn.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsildn.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rctdp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsildp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rctp1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsilnp1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsilpp1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/pfuse.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rnw_scr.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rnw5_scr.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsbdn.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsbdp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsbnp1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsbpp1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsbpp1k1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsbdn5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rsbdp5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rm1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rm2.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rm3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rm4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rm5.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rmtp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rmtpl.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rvia1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rvia2.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rvia3.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rvia4.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rviatp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rviatpl.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rctdn.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rctdp.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rctp1.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/p_rp1s.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rxw2ti.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rdn5_dpc.scs
Reading file: 
        /home/ff/ee140/fa19/xfab/XKIT/xt018/cadence/v8_0/spectre/v8_0_2/lp5mos/models/res/rdn5_pw4.scs
Reading file: 
        /home/cc/ee140/fa19/class/ee140-abc/Documents/ee240-project/Sim/zz_EE140_Fa19_digital/ams/config/netlist/amsControlSpectre.scs
Reading file: 
        /home/cc/ee140/fa19/class/ee140-abc/Documents/ee240-project/Sim/zz_EE140_Fa19_digital/ams/config/netlist/ie_card.scs
Reading file: 
        /home/cc/ee140/fa19/class/ee140-abc/Documents/ee240-project/Sim/zz_EE140_Fa19_digital/ams/config/netlist/.amsbind.scs
Reading file: 
        /share/instsww/cadence/INCISIVE.15.20.076/tools.lnx86/spectre/etc/configs/spectre.cfg
Time for NDB Parsing: CPU = 584.319 ms, elapsed = 1.07817 s.
Time accumulated: CPU = 773.701 ms, elapsed = 1.07817 s.
Peak resident memory used = 88.1 Mbytes.

ncsim> source /share/instsww/cadence/INCISIVE.15.20.076/tools/inca/files/ncsimrc
ncsim> 
ncsim> # This is the NC-SIM(R) probe command file
ncsim> # used in the AMS-ADE integration.
ncsim> 
ncsim> 
ncsim> #
ncsim> # Database settings
ncsim> #
ncsim> if { [info exists ::env(AMS_RESULTS_DIR) ] } { set AMS_RESULTS_DIR $env(AMS_RESULTS_DIR)} else {set AMS_RESULTS_DIR "../psf"}
../psf
ncsim> database -open ams_database -into ${AMS_RESULTS_DIR} -default
Created default SHM database ams_database
ncsim> 
ncsim> #
ncsim> # Probe settings
ncsim> #
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.CLK}
Created probe 1
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.DAC[7]}
Created probe 2
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.DAC[6]}
Created probe 3
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.DAC[5]}
Created probe 4
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.DAC[4]}
Created probe 5
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.DAC[3]}
Created probe 6
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.DAC[2]}
Created probe 7
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.DAC[1]}
Created probe 8
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.DAC[0]}
Created probe 9
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.DONE}
Created probe 10
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.ENABLE}
Created probe 11
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.CLK_PGA1}
Created probe 12
ncsim> probe -create -emptyok -database ams_database {zz_EE140_Fa19_digital.CLK_PGA2}
Created probe 13
ncsim> 
ncsim> run

The CPU load for active processors is :
        Spectre  0 (11.5 %)      1 (4.4 %)       2 (15.8 %)      3 (14.8 %)
                 4 (3.5 %)       5 (15.8 %)      6 (8.7 %)       7 (9.6 %)
                 8 (12.9 %)      9 (33.3 %)     10 (25.9 %)     11 (22.8 %)
                12 (16.4 %)     13 (25.4 %)     14 (26.3 %)     15 (25.0 %)
        Other   
Reading link: 
        /share/instsww/cadence/INCISIVE.15.20.076/tools.lnx86/spectre/etc/ahdl/discipline.h
Reading file: 
        /share/instsww/cadence/INCISIVE.15.20.076/tools.lnx86/spectre/etc/ahdl/disciplines.vams
Reading link: 
        /share/instsww/cadence/INCISIVE.15.20.076/tools.lnx86/spectre/etc/ahdl/constants.h
Reading file: 
        /share/instsww/cadence/INCISIVE.15.20.076/tools.lnx86/spectre/etc/ahdl/constants.vams
Time for Elaboration: CPU = 169.347 ms, elapsed = 211.944 ms.
Time accumulated: CPU = 943.386 ms, elapsed = 1.29045 s.
Peak resident memory used = 114 Mbytes.

Time for EDB Visiting: CPU = 26.559 ms, elapsed = 26.5749 ms.
Time accumulated: CPU = 970.258 ms, elapsed = 1.31734 s.
Peak resident memory used = 116 Mbytes.


Global user options:
      addflowsuffix = yes
        dotprobefmt = hier
               temp = 27
             reltol = 0.001
            vabstol = 1e-06
            iabstol = 1e-12
               gmin = 1e-12
             rforce = 1
           maxnotes = 5
           maxwarns = 5
             digits = 5
             pivrel = 0.001
     checklimitdest = psf
             rawfmt = sst2
               save = selected
               tnom = 27
              scale = 1
             scalem = 1

Scoped user options:

Circuit inventory:
              nodes 439
              bsim4 706   
          capacitor 6     
connectLib__E2L_2_dynsup__module__0x10000001_behavioral 3     
connectLib__L2E_2_dynsup__module__0x10000001_behavioral 3     
            vsource 4     

Analysis and control statement inventory:
               info 4     
               tran 1     

Output statements:
             .probe 0     
           .measure 0     
               save 5     

Time for parsing: CPU = 31.197 ms, elapsed = 35.5098 ms.
Time accumulated: CPU = 1.00176 s, elapsed = 1.35316 s.
Peak resident memory used = 119 Mbytes.

~~~~~~~~~~~~~~~~~~~~~~
Pre-Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~
~~~~~~~~~~~~~~~~~~~~~~

************************************************
Transient Analysis `tran': time = (0 s -> 15 us)
************************************************
DC simulation time: CPU = 44.842 ms, elapsed = 45.068 ms.
Important parameter values:
    start = 0 s
    outputstart = 0 s
    stop = 15 us
    step = 15 ns
    maxstep = 150 ns
    ic = all
    useprevic = no
    skipdc = no
    reltol = 100e-06
    abstol(V) = 1 uV
    abstol(I) = 1 pA
    temp = 27 C
    tnom = 27 C
    tempeffects = all
    errpreset = conservative
    method = gear2only
    lteratio = 10
    relref = alllocal
    cmin = 0 F
    gmin = 1 pS


Output and IC/nodeset summary:
                 save   5       (voltage)

    tran: time = 438.3 ns    (2.92 %), step = 64.03 ns     (427 m%)
    tran: time = 1.133 us    (7.55 %), step = 17.01 ns     (113 m%)
    tran: time = 1.891 us    (12.6 %), step = 99.61 ns     (664 m%)
    tran: time = 2.635 us    (17.6 %), step = 18.37 ns     (122 m%)
    tran: time = 3.395 us    (22.6 %), step = 59.75 ns     (398 m%)
    tran: time = 4.14 us     (27.6 %), step = 19.74 ns     (132 m%)
    tran: time = 4.881 us    (32.5 %), step = 57.08 ns     (381 m%)
    tran: time = 5.629 us    (37.5 %), step = 17.49 ns     (117 m%)
    tran: time = 6.376 us    (42.5 %), step = 57.79 ns     (385 m%)
    tran: time = 7.143 us    (47.6 %), step = 20.52 ns     (137 m%)
    tran: time = 7.883 us    (52.6 %), step = 57.73 ns     (385 m%)
    tran: time = 8.629 us    (57.5 %), step = 17.55 ns     (117 m%)
    tran: time = 9.383 us    (62.6 %), step = 59.25 ns     (395 m%)
    tran: time = 10.14 us    (67.6 %), step = 20.05 ns     (134 m%)
    tran: time = 10.89 us    (72.6 %), step = 59.16 ns     (394 m%)
    tran: time = 11.63 us    (77.5 %), step = 55.11 ns     (367 m%)
    tran: time = 12.43 us    (82.8 %), step = 66.11 ns     (441 m%)
    tran: time = 13.13 us    (87.5 %), step = 17.9 ns      (119 m%)
    tran: time = 13.9 us     (92.7 %), step = 61.8 ns      (412 m%)
    tran: time = 14.63 us    (97.5 %), step = 18.01 ns     (120 m%)

The analog simulator has reached stop time, please use `analog -stop <new stop time>' to extend the analog stop time.
Simulation stopped via transient analysis stoptime at time 15 US
Memory Usage - 38.6M program + 463.0M data = 501.6M total
CPU Usage - 0.4s system + 62.3s user = 62.6s total (99.0% cpu)
ncsim> exit
Number of accepted tran steps =             6820

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
Post-Transient Simulation Summary
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
   -   To further speed up simulation, consider
          add ++aps on command line
   -   Non-default settings that could significantly slow down simulation
          errpreset = conservative, default moderate
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~


During simulation, the CPU load for active processors is :
        Spectre  0 (9.4 %)       1 (3.1 %)       2 (6.4 %)       3 (5.4 %)
                 4 (15.2 %)      5 (14.1 %)      6 (2.0 %)       7 (20.2 %)
                 8 (16.8 %)      9 (24.5 %)     10 (25.0 %)     11 (20.1 %)
                12 (8.3 %)      13 (19.0 %)     14 (17.7 %)     15 (9.1 %)
        Other   
Initial condition solution time: CPU = 44.923 ms, elapsed = 45.15 ms.

**** AMSD: Mixed-Signal Activity Statistics ****
Number of A-to-D events:                      84
  Number of A-to-D events in IEs:             84
Number of D-to-A events:                      40
  Number of D-to-A events in IEs:             40
Number of VHDL-AMS Breaks:                     0

Intrinsic tran analysis time:    CPU = 61.6648 s, elapsed = 61.704 s.
Total time required for tran analysis `tran': CPU = 61.7198 s (1m  1.7s),
        elapsed = 61.7603 s (1m  1.8s).
Time accumulated: CPU = 62.7278 s (1m  2.7s), elapsed = 63.1232 s (1m  3.1s).
Peak resident memory used = 128 Mbytes.

finalTimeOP: writing operating point information to rawfile.

Opening the PSF file ../psf/finalTimeOP.info ...
modelParameter: writing model parameter values to rawfile.

Opening the PSF file ../psf/modelParameter.info ...
element: writing instance parameter values to rawfile.

Opening the PSF file ../psf/element.info ...
outputParameter: writing output parameter values to rawfile.

Opening the PSF file ../psf/outputParameter.info ...
Simulation complete via transient analysis stoptime at time 15 US

Aggregate audit (1:14:11 AM, Fri Nov 29, 2019):
Time used: CPU = 62.8 s (1m  2.8s), elapsed = 63.3 s (1m  3.3s), util. =
        99.3%.
Time spent in licensing: elapsed = 37.3 ms.
Peak memory used = 129 Mbytes.
Simulation started at: 1:13:08 AM, Fri Nov 29, 2019, ended at: 1:14:11 AM, Fri
        Nov 29, 2019, with elapsed time (wall clock): 63.3 s (1m  3.3s).
spectre completes with 0 errors, 0 warnings, and 0 notices.
ncsim: Memory Usage - 38.6M program + 462.9M data = 501.5M total (501.6M Peak)
ncsim: CPU Usage - 0.4s system + 62.4s user = 62.8s total (63.4s, 99.1% cpu)
